IDEA StatiCa Open Model
RebarStirrups.Patterns Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets or sets the pattern of the rebar grouping. Holds distance between rebars/stirrups and length
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public List<RebarStirrupPattern> Patterns { get; set; }
Public Property Patterns As List(Of RebarStirrupPattern)
	Get
	Set
public:
property List<RebarStirrupPattern^>^ Patterns {
	List<RebarStirrupPattern^>^ get ();
	void set (List<RebarStirrupPattern^>^ value);
}
Property Value
Type: List<RebarStirrupPattern>
See Also
Reference
RebarStirrups Class
IdeaRS.OpenModel.Model Namespace